In [1]:
import numpy as np
import pandas as pd
import os
FOLDER = "Data/"
os.listdir(FOLDER)

['.ipynb_checkpoints',
 'combined_api_results.csv.gz',
 'final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'title-akas-us-only.csv',
 'title.basics.csv.gz',
 'title.ratings.csv.gz',
 'tmdb_api_results_2000.json',
 'tmdb_api_results_2001.json']

### Load Title Basics

In [2]:
basics = pd.read_csv('Data/title.basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

### Normalizing Genres 

   * In order to normalize genres, we will need to:
        
        * Convert the single string of genres from title basics into 2 new tables
            
            1. title_genres: with the columns:
              
                * tconst
                
                * genre_id
                
            2. genres:
            
                * genre_id
                
                * genre_name
     
      * Discard unnecessary information:   
      
          * For the title basics table, drop the following columns
      
              * "original_title" (we will use the primary title column instead)
              
              * "isAdult" ("Adult" will show up in the genres so this is redundant information)
              
              * "titleType" (every row will be a movie)
              
              * "genres" and other variants of genre (genre is now represented in the 2 new tables described above

#### Getting a List of Unique Genres

In [3]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [4]:
# Creating new rows for all possible genre categories
exploded_genre = basics.explode('genres_split')
exploded_genre.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,Drama

In [5]:
# Sort genres
genre_values = sorted(exploded_genre['genres_split'].unique())

####  Create a new title_genres table

In [6]:
# Create new 'title_genre' table
title_genre = exploded_genre[['tconst', 'genres_split']].copy()
title_genre.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

#### Create a genre mapper dictionary to replace string genres with interger ids

In [7]:
# Outline dictinary  
# genres as keys, id as values

genre_id = range(len(genre_values))
genre_map = dict(zip(genre_values, genre_id))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

#### Convert the genre map dictionary into a dataframe

In [8]:
# Convert genre_dict to dictionary for title_genre table
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                      'genre_id': genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

#### Discard unneccessary columns

In [9]:
#drop unneccessary columns
basics = basics.drop(columns=['genres_split','originalTitle','isAdult','titleType','genres','endYear'])

In [10]:
basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0068865,Lives of Performers,2016,90
3,tt0069049,The Other Side of the Wind,2018,122
4,tt0088751,The Naked Monster,2005,100

### Load in Ratings

In [11]:
ratings = pd.read_csv('Data/title.ratings.csv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     87411
1  tt0062336            6.4       179
2  tt0068865            5.4        75
3  tt0069049            6.7      7806
4  tt0088751            5.2       339

### Load TMDB API Results

* You only need to keep the 
  
  * imdb_id 
  * revenue 
  * budget  
  * certification columns

In [12]:
# Open saved file and preview again
tmdb_data = pd.read_csv("Data/combined_api_results.csv.gz", low_memory = False)
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.450,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.113,2300.0,PG

In [13]:
# Keep only the columns called for in tmdb
tmdb_data = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_data.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  14204632.0    150000.0            PG

In [14]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2599 entries, 0 to 2598
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2599 non-null   object
 1   revenue        2597 non-null   float64
 2   budget         2597 non-null   float64
 3   certification  816 non-null    object
dtypes: float64(2), object(2)
memory usage: 81.3+ KB

### MySQL Database Requirements

   *  Use sqlalchemy with Pandas to execute your SQL queries inside your notebook.

   *  Create a new database on your MySQL server and call it "movies."

   *  Make sure to have the following tables in your "movies" database:
    
        * title_basics

        * title_ratings
         
        *  title_genres
         
        * genres
         
        * tmdb_data
         
   *  Make sure to set a Primary Key for each table that isn't a joiner table (e.g., title_genres is a joiner table).

   * After creating each table, show the first 5 rows of that table using a SQL query.

   * Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

In [15]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import json
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:root@localhost/movies"
#create the engine to make connection between Python and MySQL
engine = create_engine(connection_str)

In [16]:
## Check if database exists, if not, create it
if database_exists(connection_str):
    print('It exists!')
else:
    create_database(connection_str)
    print('Database created!')

It exists!

#### Title Basics

In [17]:
from sqlalchemy.types import *
# Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

In [18]:
# Create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [19]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

81888

In [20]:
#Add primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [21]:
#showing first 5 rows of the title_basics table
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0068865,Lives of Performers,2016.0,90
3,tt0069049,The Other Side of the Wind,2018.0,122
4,tt0088751,The Naked Monster,2005.0,100

#### Title Ratings

In [22]:
## Calculate max string lengths for object columns
key_len_2 = ratings['tconst'].fillna('').map(len).max()

In [23]:
## Create a schema dictonary using Sqlalchemy datatype objects
ratings_schema = {
    "tconst": String(key_len_2+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [24]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',index=False)

68055

In [25]:
#Add primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [26]:
#showing first 5 rows of the title_ratings table
q = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0035423            6.4     87411
1  tt0062336            6.4       179
2  tt0068865            5.4        75
3  tt0069049            6.7      7806
4  tt0088751            5.2       339

#### Title Genre

In [27]:
#joiner table 
title_genre.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 153571 entries, 0 to 81887
Data columns (total 2 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   tconst        153571 non-null  object
 1   genres_split  153571 non-null  object
dtypes: object(2)
memory usage: 3.5+ MB

In [28]:
## Calculate max string lengths for object columns
no_key_len = title_genre['tconst'].fillna('').map(len).max()

In [29]:
## Create a schema dictonary using Sqlalchemy datatype objects
title_genre_schema = {
    "tconst": Text(no_key_len+1),
    'genre_id':Integer()}

In [30]:
# Save to sql with dtype and index=False
title_genre.to_sql('title_genre',engine,dtype=title_genre_schema,if_exists='replace',index=False)

153571

In [31]:
#showing first 5 rows of the title_genre table
q = """SELECT * FROM title_genre LIMIT 5;"""
pd.read_sql(q, engine)

      tconst genres_split
0  tt0035423       Comedy
1  tt0035423      Fantasy
2  tt0035423      Romance
3  tt0062336        Drama
4  tt0068865        Drama

#### Genres

In [32]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  25 non-null     object
 1   genre_id    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [34]:
## Set the dataframe index and use index=True 
genres.set_index('genre_id').to_sql('genres',engine,if_exists='replace',index=True)

25

In [35]:
## Calculate max string lengths for object columns
genres_len = genres['genre_name'].fillna('').map(len).max()

In [36]:
## Create a schema dictonary using Sqlalchemy datatype objects
genres_schema = {
    "genre_name": Text(genres_len+1),
    'genre_id':Integer()}

In [37]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=genres_schema,if_exists='replace',index=False)

25

In [38]:
#Add primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [39]:
#showing first 5 rows of the genres table
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

#### TMDB Data

In [40]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2599 entries, 0 to 2598
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2599 non-null   object
 1   revenue        2597 non-null   float64
 2   budget         2597 non-null   float64
 3   certification  816 non-null    object
dtypes: float64(2), object(2)
memory usage: 81.3+ KB

In [41]:
## Calculate max string lengths for object columns
imdb_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

In [42]:
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_schema = {
    "imdb_id": String(imdb_len+1),
    'revenue': Float(),
    'budget': Float(),
    'certification': Text(cert_len+1)}

In [43]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_schema,if_exists='replace',index=False)

2599

In [44]:
#showing first 5 rows of the tmbd_data table
q = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0116391         0.0         0.0          None
4  tt0118694  14204600.0    150000.0            PG

In [45]:
q = '''SHOW TABLES FROM movies;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2      title_genre
3    title_ratings
4        tmdb_data